{
  "appPageId": "bc7511ba-0fce-40eb-b7e3-1ebb0d62c409",
  "componentName": "siteforce:sldsOneColLayout",
  "id": "70922158-ee8e-4243-9c34-0f683c90c5de",
  "label": "Experience",
  "regions": [
    {
      "components": [
        {
          "componentAttributes": {
            "title": "Johnson and Johnson"
          },
          "componentName": "c:contentHeader",
          "id": "db3d5594-ef86-4cd7-a7c0-ac01c638dbbe",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {
            "richTextValue": "<h2><b>Salesforce Developer (Contract)</b></h2><h4><b>Nov 2019 - Current</b></h4><p><br></p><p><span style=\"font-size: 16px;\">During my first year of working for Johnson and Johnson as an Application Support Analyst, I started making the right connections and worked my way into a postion as a Salesforce Developer. Johnson and Johnson boasts a healthy portfolio of Salesforce instances. Thus, the great opportunity about working for them is that there are a wide array of projects to get into within the various sectors of J&amp;J. However, the responsibilities and day-to-day work does not vary wildy as most project teams work in an agile framework to deliver business requested features within a given iteration. While being a good developer is helpful, J&amp;J also places great value in effective communication. This can range from the abilty to relay roadblocks in current devlopment during standup, contributing to the technical design of a story in refinement, or framing demos appropriately to a non-technical audience. I have developed and continue to grow these skills having served on the following projects:</span></p><p><br></p><p><b style=\"font-size: 16px;\">askGS:</b><span style=\"font-size: 16px;\">&nbsp;&nbsp;The first official project I served on was quite exciting as it was a Salesforce Community human resources portal which was to be utilized for Johnson and Johnson's 100,000+ employees. The previous askGS (GS standing for Global Services) portal was a Salesforce Site.com site, and entering into 2020 was in need of a overhaul. The Salesforce org as a whole has been developed and maintained by our Salesforce pratners in Europe (specifically based in Ireland) who themselves have built out much of the functionality and features for the new portal. The job of myself and a couple other developers based in my office was to implement the UI/UX specifications. With us focused on the styling, our EMEA counterparts could focus on building out the rest of the functionality so that the portal could go-live by new year of 2020.</span></p><p><br></p><p><span style=\"font-size: 16px;\">The work in general mostly consisted of CSS styling. Salesforce communities can be quite amazing in that you could design an entire site yourself and one wouldn't even recognize that it is Salesforce under the covers. Of course, the more you drift away from out of the box styling, the more effort required. With the askGS project, a 3rd party UI/UX team designed some wireframes that were approved by the business as the final design for the site. All in all, the design was nothing to extravagant, it mostly followed the design standards of J&amp;J specific websites which features a unqiue branding colors, fonts, and icons. Applying the design mostly occured at the component level, and we tried to utilize as little needed CSS override as possible. The biggest challenge we faced would have had to be accomadting the style to all available languages. As an international platform, there were up to 20 available languges to select to render the site. With sybmbol based languages like Japanese, Korean, and Thai, we had to be extra careful with the word break/wrapping as sometimes a translation can become confusing or even sometimes offensive. </span></p><p><br></p><p><b style=\"font-size: 16px;\">Visioncare: </b><span style=\"font-size: 16px;\">After the askGS project and entering the 2020 year, a few co-workers and I from the Tampa Development Center were placed into the vision sector of Johnson and Johnson. The vision sector has several Salesforce instances, each one specific to a region: NA, EMEA, ASPAC, and LATAM. While serving on the project, the team primarily worked in the NA and EMEA instances.</span></p><p><br></p><p><span style=\"font-size: 16px;\">One of the major features I helped build was a tablet-centric calendar using the </span><a href=\"https://fullcalendar.io/\" target=\"_blank\" style=\"font-size: 16px;\">FullCalendar</a><span style=\"font-size: 16px;\"> framework. The vision sector sales users using the org may make up to 8 to 10 sales calls/check-ins a day. Since a majority of these meetings are in-person, a majority of sales people are issued a iPad for logging their calls on in Salesforce while traveling. Thus, a much needed enhancement was this custom calendar application. While Salesforce offers a calendar out of the box, our custom built calendar allows the user to click on an event (scheduled call) which pops out a sidebar for them to review their pre-meeting notes, get the location address, and log their post-meeting call all in one place. What was very exciting about the work is that the team has also stripped down the calendar to its bare functionality which allows it to be easily transposed to other Salesforce orgs. Thus, any in Johnson and Johnson's portfolio could (and have) consume this calendar, and alter to their business-specific needs.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Another major feature we delivered was called Coach Calling. This feature enbles regional managers to create coaching sessions for their sales people. For any given account call a sales agent makes in Salesforce, a manager can create a coaching session off of that sales call. During the meeting a manager is not so much coaching but observing, and after the call/meetnig a manager can log their notes and ratings into that coaching session. The feature allows sales agents to receive feedback, and manager's can accumulate a summary on how well sales people are engagaing with their regional accounts. The challenges of developing this feture revolved around record security with consideration of the territory hierarchy. There were tricky scenarios given by the business like sharing and unsharing coaching sessions when a sales agent moves to a new territory.</span></p><p><br></p><p><b style=\"font-size: 16px;\">Depuy Sythese Community Cloud: </b><span style=\"font-size: 16px;\">Due to the circumstances of COVID-19, the vision sector team I was supposed to serve on through 2020 cut back on funding. Luckily, I was able to find work in one of Johnson and Johnson's more stable sectors: Medical Devices. The primary Salesforce org for the sector has many name variations due to the many applications on the platform itself. However, when I came onto the team I was a part of a new initiative to create a Salesforce Community intended to be used by all North America Medical Device employees. A common occurence I have started to see, the drive behind the project was to replace an exisiting sunsetting technology (Drupal site).</span></p><p><br></p><p><span style=\"font-size: 16px;\">One of the exciting features that the community would offer out of the box that they did not have prior was social engagemnt via Chatter. This ability would allow users to ask questions, levae feedback, and collaborate with others without having to do it through instant messaging or email. The contentin the portal ranges, but one of the primary content types is Surgical Techniques. The sales people within the Medical Device sector are very unique. Not only are they selling medicl devices, but are well-trained licensed surgeons themselves who use this content to keep up on the latest updates to surgical techniques realted to J&amp;J's wide array of medical devices. The community also features Community Events which gives visibility to the various events going on withing the Medical Device sector and allows users to attend them. Other minor features include a quick links tab that lets users see a slew of helpful links, and filter them based off keywords. Additionally, we leveraged public groups out of the box which allows users to join groups based off their specific area of expertise which can range from marketing teams to anatomical area experts. </span></p><p><br></p><p><span style=\"font-size: 16px;\">Most of the major challenges with the project centered around the content management feature. While Salesforce offers a CMS solution, it didn not meet the business requirements. We also considered using Knowledge which does versioning as needed, but ran into limitations around file size limits. Nothing absolutely captured all of the requirements, but we found the most control in doint it with a custom object. To expand on the requirements, the community has a persona called super users; these super users are the ones that are allowed to submit content to expose to the whole community. However, if the content is something like a Surgical Technique, it needs to be submitted for approval to a higher persona called a business admin. Thus, the trickery came into creating this approval process, and sharing content with the whole community when it is approved and unsharaing it when expired or outdated.</span></p><p><br></p><p><b style=\"font-size: 16px;\">Capital Selling CRM:</b></p><p><br></p><h2><b>Application Support Analyst (Contract)</b></h2><h4><b>Sept 2018 – Oct 2019</b></h4><p><br></p><p><span style=\"font-size: 16px;\">One week after earning my Salesforce Admin certification, I was grateful to land a job with Johnson &amp; Johnson as an Application Support Analyst. Technology Services at J&amp;J can be split up into two sectors: BUILD and RUN. This role was within the RUN sector. Furthermore, the RUN sector can be split up even further into various clusters with varying technology specialties. The cluster I served on was called Customer &amp; Sales which specializes primarily in Salesforce technology. The application portfolio boasts over 30 unique Salesforce instances. Each of these Salesforce applications are owned by a Johnson and Johnson business, and the day-to-day support activities that may be required for these applications are done by a 3rd-party vendor (Cognizant for Customer &amp; Sales). Thus, the RUN team serves as a liaison between the owning-business and the vendor.</span></p><p><br></p><p><span style=\"font-size: 16px;\">Since these support activites are done by contractors, I seldomly found myself within a Salesforce instance doing actual support. However, I often did help triage incident tickets submitted by varios application users through an internal ticketing tool developed by J&amp;J called IRIS. Thus, my understanding of Salesforce is being applied and growing every day to help mitigate issues.</span></p><p><span style=\"font-size: 16px;\">While that broadly covers some of the day-to-day duties, I was also responsible for several long-term projects and goals:</span></p><p><br></p><ul><li><b style=\"font-size: 16px;\">Operations Run Book (ORB):&nbsp;</b><span style=\"font-size: 16px;\">Key documentation for an application includes a Technical Design Specifications (TDS) and an Operations Run Book (ORB). A TDS is created by the BUILD team during development, and details the entire inner workings and acrchitecture of an application. An ORB further details information that may not be covered by a TDS such as points of failures, impacted user communities, communication and resolution protocols for outages, and comprehensive contact information. When I came onto the team and started learning about supporting the cluster's applications, I was pointed towards the application's corresponding ORB to learn more about supporting any said application. However, we soon realized the overall landscape of our cluster's ORBs was in a poor state. Thus, I was put in charge of an effort to work with the various support teams to help improve the quality of each application's ORB and bring them to our baseline standards.</span></li></ul><p><br></p><ul><li><b style=\"font-size: 16px;\">Aggrify:&nbsp;</b><span style=\"font-size: 16px;\">One of my favorite projects was enabling a service-level targeting tool offered by another RUN team cluster (Data &amp; Analytics) called Aggrify. This tool captures pertinent metadata about any jobs a application may have. We enabled this tool specifically for Scheduled Apex classes within our various Salesforce applications. With Aggrify enabled, we could monitor for job success and failures, analyze the mean time for a job to complete, and troubleshoot possible solutions to make the job run more efficiently.</span></li></ul><p><br></p><ul><li><b style=\"font-size: 16px;\">Knowledge Articles:&nbsp;</b><span style=\"font-size: 16px;\">Whenever a incident ticket is resolved in IRIS, you are required to find or create an appropriate Knowledge Article that details the steps taken to resolve the issue in order to close the ticket. Over-time you build a strong Knowledge Base, and steps to resolve repeated issues can be found easily. However, over-time we have found that the vendor had cut corners, and created lazy Knowledge Articles that have no sustenance whatsoever, and only polluted the Knowledge Base. To help mitigate this issue, our cluster created an audit process to randomly select various Knowledge Articles created in the prior month and verify the quality of their content. If a Knowledge Article does not meet the baseline standards, we provided feedback to the original author and they were to update it appropriately. </span></li></ul><p><br></p><ul><li><b style=\"font-size: 16px;\">CopyStorm:&nbsp;</b><span style=\"font-size: 16px;\">CopyStorm is a suite of 3rd party tools offered by&nbsp;</span><a href=\"https://www.capstorm.com/\" target=\"null\" style=\"font-size: 16px;\"><b>CapStorm</b></a><span style=\"font-size: 16px;\">&nbsp;which allow you to backup salesforce data and metadata, and restore it to any environment. So, should an application have a major release go awry, you can restore a production environment to a previous stable state with clean data. We have started integrating our portfolio of applications with CopyStorm since mid 2019. While this service is primarily supported by our vendor (Cognizant), a co-worker and I have been involved in the process as an learning experience.</span></li></ul><p>&nbsp;</p>"
          },
          "componentName": "forceCommunity:richTextInline",
          "id": "07db7386-238e-4a32-a116-fcd9549c72e3",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {
            "title": "Franco Signor"
          },
          "componentName": "c:contentHeader",
          "id": "77ebd8cc-0ece-4147-9cef-0f488b31adca",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {
            "richTextValue": "<p><br></p><h2><b>Intern Junior Developer</b></h2><h4><b>Jun 2015 – Aug 2018</b></h4><p><br></p><p><span style=\"font-size: 16px;\">While attending college at University of South Florida Sarasota-Manatee, I was fortunate enough to intern part-time as a Junior Developer at Franco Signor LLC. The company operates within the Medicare industry; more specifically Medicare Secondary Payer (MSP) compliance and solutions. As a Junior Developer, my day-to-day responsibilities included:</span></p><p><br></p><ul><li><span style=\"font-size: 16px;\">Programming SSIS packages that query client data using SQL which is then&nbsp;transformed and imported into the appropriate Salesforce objects.</span></li><li><span style=\"font-size: 16px;\">Design and develop various internal, web-based applications (.NET/C#) that allow the sales and operations teams to interact with client data.</span></li><li><span style=\"font-size: 16px;\">Collaborate in a team environment with IT, operations, and sales to design and create customized solutions crucial to business operations.</span></li><li><span style=\"font-size: 16px;\">Maintain existing applications to eliminate bugs, add minor enhancements, and improve business productivity.</span></li><li><span style=\"font-size: 16px;\">Develop customized SSRS reports for analysis based on business requirements.</span></li><li><span style=\"font-size: 16px;\">Database design, maintenance, and normalization in SQL Server Management Studio</span></li><li><span style=\"font-size: 16px;\">Provide maintenance and support for company’s public facing WordPress website:&nbsp;</span><a href=\"https://francosignor.com/\" target=\"null\" style=\"font-size: 16px;\"><b>https://francosignor.com/</b></a></li></ul><p>&nbsp;</p>"
          },
          "componentName": "forceCommunity:richTextInline",
          "id": "7ab39bee-8115-4d71-85cc-20e33205783d",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        }
      ],
      "id": "cc38581b-0157-4da4-9915-db78e24f3d66",
      "regionName": "header",
      "type": "region"
    },
    {
      "id": "7277d002-4513-49ea-82be-dcb5f3f4b920",
      "regionName": "content",
      "type": "region"
    },
    {
      "id": "ca94cfd9-4b5a-416e-82f9-a1b80d391533",
      "regionName": "footer",
      "type": "region"
    },
    {
      "components": [
        {
          "componentAttributes": {
            "description": "",
            "metaTags": "",
            "title": "Experience"
          },
          "componentName": "forceCommunity:seoAssistant",
          "id": "29e4fd3b-c09b-48e7-9421-808dc37688b5",
          "renditionMap": {},
          "type": "component"
        }
      ],
      "id": "d8423874-db69-4485-ba76-02673e90f1ae",
      "regionName": "sfdcHiddenRegion",
      "type": "region"
    }
  ],
  "themeLayoutType": "eUAdC6huiSJLF5YnINgMBtsRTwGCGb",
  "type": "view",
  "viewType": "custom-experience"
}
