{
  "appPageId": "bc7511ba-0fce-40eb-b7e3-1ebb0d62c409",
  "componentName": "siteforce:sldsOneColLayout",
  "id": "cd4829cf-beb5-4f32-97b6-50376d6ab3c5",
  "label": "Salesforce",
  "regions": [
    {
      "id": "e54128cc-8a0c-4fde-9e24-e0e447ba8099",
      "regionName": "header",
      "type": "region"
    },
    {
      "components": [
        {
          "componentAttributes": {
            "title": "Franco Signor"
          },
          "componentName": "c:contentHeader",
          "id": "8c420c90-ac14-4bc3-be7c-41aad60c15f6",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {
            "richTextValue": "<p><span style=\"font-size: 16px;\">I list my Salesforce experience gained while working at Franco Signor first because it was the first time I was&nbsp;exposed to the platform. However, most of my experience was more so in interacting with the Salesforce API, and as laid out in my experience&nbsp;section for Franco Signor: Programming SSIS packages that query client data using SQL which is then&nbsp;transformed and imported into the appropriate Salesforce objects.</span></p><p><br></p><p><span style=\"font-size: 16px;\">As time carried on, Franco Signor began leveraging the power of Salesforce more and more. Utilizing features&nbsp;such as workflow rules, process builders, and flows. While I poked around a little and inspected what they were doing, I had not built any of this functionality. In fact, it was all done by one business analyst,</span><a href=\"https://www.linkedin.com/in/brandon-weber-76500553\" target=\"_blank\" style=\"font-size: 16px;\"><b> Brandon Webber</b></a><span style=\"font-size: 16px;\">, who eventually went on to become a Sr. Associate at PricewaterhouseCoopers thanks to his experience learning Salesforce. So, as my graduation date neared and I began pondering what my career path may look like; Brandon had encouraged me&nbsp;to get into Salesforce.&nbsp;</span></p><p> </p>"
          },
          "componentName": "forceCommunity:richTextInline",
          "id": "9d5d2b20-152a-4f5f-8193-f36fcd2e553d",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {
            "title": "Trailhead"
          },
          "componentName": "c:contentHeader",
          "id": "772acd4d-0562-45ec-ac71-49b51f49e624",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {
            "richTextValue": "<h3>Profile:&nbsp;<a href=\"https://trailhead.salesforce.com/me/matthewdoles\" target=\"null\">Matthew Doles</a></h3><h3>2 x Ranger</h3><p><br></p><p><span style=\"font-size: 16px;\">Like any earnest Salesforce Developer, my journey truly took off when I became an official Trailblazer which was in May of 2018. I had previously done some Trailhead here and there prior, but this is truly when I started dedicating hours to learn Salesforce. After a few months and&nbsp;</span><a href=\"https://www.udemy.com/salesforce-administrator/\" target=\"null\" style=\"font-size: 16px;\"><b>Mike Wheeler's great Admin Course</b></a><span style=\"font-size: 16px;\">&nbsp;, I had became a Salesforce Certified Administrator.</span></p><p><br></p><p><span style=\"font-size: 16px;\">As mentioned in my experience section for Johnson &amp; Johnson, I had landed a job on contract there thanks to my new certification. So, while I was getting acquainted with my new role, my Trailhead journey took a small pause. However, the quest for more certifications came back with a force in late December of 2018 when I began prepping for the Platform App Builder exam by using Trailhead and yet another great&nbsp;</span><a href=\"https://www.udemy.com/course/salesforce-platform-app-builder/\" target=\"null\" style=\"font-size: 16px;\"><b>Mike Wheeler course for Platform App Builder</b></a><span style=\"font-size: 16px;\">. In fact, I had attempted and passed the exam on Christmas Eve which had made for an extra enjoyable holiday season.</span></p><p><br></p><p><span style=\"font-size: 16px;\">However, I was still not done. I quickly turned around and dedicated myself to earning the Platform Developer I certification. This is when I truly leaned in on Trailhead as I worked my way through their official&nbsp;</span><a href=\"https://trailhead.salesforce.com/en/users/strailhead/trailmixes/prepare-for-your-salesforce-platform-developer-i-credential\" target=\"null\" style=\"font-size: 16px;\"><b>Platform Developer I Trail</b></a><span style=\"font-size: 16px;\">. With only a little over a month of elapsed time since I had passed my previous exam, I attempted and passed the Platform Developer I exam.</span></p><p><br></p><p><span style=\"font-size: 16px;\">At this point of time, I had become close to Ranger status. So as I made that push, I took a shining to the Superbadges as they provide real-world scenarios instead of just walking you through a simple project. Some of my favorite Trailhead material that I really took to dealt with front-end development. In fact, around this time Lighting Web Components (LWC) was trending up - the new and improved alternative to Aura components. Consuming the&nbsp;</span><a href=\"https://github.com/trailheadapps/lwc-recipes\" target=\"null\" style=\"font-size: 16px;\"><b>LWC Recipes</b></a><span style=\"font-size: 16px;\">&nbsp;was a huge resource to learning LWC; I even made it an exercise to re-program all the components line-by-line to understand their inner wrokrings.</span></p><p><br></p><p><span style=\"font-size: 16px;\">From 2019 into 2020 I eventually made it to double ranger. With 2020 being the year that will notoriously be remembered as one where everyone quarantined,&nbsp;the extra time made it easy to accomplish this goal. In addition, I also set out to get the newly introduced JavaScript Developer I certification. Having already spent a better part of the past year or so (at the time) learning everything JavaScript from LWC to Node to React to etc. I felt adequetly prepared to jump right in and just go for it. The only sort of preparation I did was complete the </span><a href=\"https://trailhead.salesforce.com/content/learn/superbadges/superbadge_lwc_specialist\" target=\"_blank\" style=\"font-size: 16px;\"><b>Lightning Web Component Specialist</b></a><span style=\"font-size: 16px;\"> Superbadge, which I found out afterwards was actually a requirement for earning the certification. The exam itself is one of the most unique Salesforce exams I have taken. In fact, I would say none of it is actually focused on anything Salesforce itself, it is all pure JavaScript. Thus, a good certification for those from a web development backgorund or similar that want to get into Salesforce. </span></p><p><br></p><p><span style=\"font-size: 16px;\">Although it started as an exercise for learning SFDX, I try to do as much Trailhead exercises as possible in my devloper edition org and track it in source control:&nbsp;</span><a href=\"https://github.com/matthewdoles/salesforce-dev-doles-dx\" target=\"null\" style=\"font-size: 16px; background-color: rgb(255, 255, 255);\"><b>salesforce-doles-dx.</b></a></p><p>&nbsp;</p>"
          },
          "componentName": "forceCommunity:richTextInline",
          "id": "ce538d36-6d10-47c9-8df5-8075fadeacce",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {
            "title": "Johnson and Johnson"
          },
          "componentName": "c:contentHeader",
          "id": "afc0d355-86fe-4ea5-b7f9-1f2555ddcdc8",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {
            "richTextValue": "<p><span style=\"font-size: 16px;\">I really began to grow into Salesforce profesionally with my first job at Johnson and Johnson as an Application Support Analyst. I took this role primiarly for its promising opportunity to grow into a Salesforce developer role. On top of that, it was for a company I could take pride in to work for. As my</span><b style=\"font-size: 16px;\"> </b><a href=\"/experience\" target=\"_blank\" style=\"font-size: 16px;\"><b>Experience</b></a><b style=\"font-size: 16px;\"> </b><span style=\"font-size: 16px;\">page more thoroughly describes, my intial Application Support Analyst role was on the operational side of Johnson and Johnson's teschnology services. The team I served on acted as a liason between the application owners and vendors that would do the day-to-day support. Our specific team concentrated in the support of Johnson and Johnson's Salesforce organizations which totals over 60. </span></p><p><br></p><p><span style=\"font-size: 16px;\">What my </span><a href=\"/experience\" target=\"_blank\" style=\"font-size: 16px;\"><b>Experience</b></a><span style=\"font-size: 16px;\"> page won't really detail is how I exactly worked my way into a Salesforce Developer role. The first steps were pretty obvious and that was to pursue my Platform App Builder and Platform Developer I certifications. With those in hand, I could I could start getting my feet wet at as a developer on a enterprise level with Johnson and Johnson. On my road to certification, I started to get connected with the Salesforce development team within my office. One of the lead developers,</span><b style=\"font-size: 16px;\"> </b><a href=\"https://www.linkedin.com/in/rick-mason-cloud/\" target=\"_blank\" style=\"font-size: 16px;\"><b>Rick Mason</b></a><span style=\"font-size: 16px;\">, was very helpful in mentoring, not just me, but any person interested in getting into Salesforce and pursing certifications.</span></p><p><br></p><p><span style=\"font-size: 16px;\">With those certifications in hand, opportunities started to arise to work on some Proof of Concept (PoC) projects. The first one I worked on was a </span><span style=\"font-size: 16px; background-color: transparent; color: var(--lwc-colorTextDefault,rgba(0, 0, 0, 0.8));\">Business Technology Leaders (BTL) Interaction Manager. BTL's within J&amp;J are pretty high up on the totem pole, these </span><span style=\"font-size: 16px;\">individuals determine what applications are going to built, what technology is going to be used to built them, what&nbsp;resources do we have to build them, etc. In a sense, they are the decision makers. This BTL Interaction Manager PoC was&nbsp;built to demo how Salesforce could help capture some of those high-level conversation and put pen to paper.</span></p><p><br></p><p><span style=\"font-size: 16px;\">The second project I have worked on was a Visualforce to Lightning conversion/exercise. The Salesforce BUILD Team for&nbsp;J&amp;J have built an internal management tool (Salesforce instance) which helps them track demand, projects, resources, etc. Projects (Opportunity standard object) have related resources (Opportunity Resources custom object) which need to be filled by various employees (Contact standard object). When the application was built, a Visualforce page was&nbsp;developed to manage this interaction of assigning contacts to a project role (Opportunity Resource) for a project (Opportunity).&nbsp;This Visualforce page was called Opportunity Resource Management, and while the Visualforce page got the job done -&nbsp;&nbsp;it was in need of a makeover. Thus, my role was to convert this Visualforce page into an Aura Component(s). The functionality largely remains the same, but the presentation and intuitiveness&nbsp;was made a bit more user friendly.</span></p><p><br></p><p><span style=\"font-size: 16px;\">With that experience in hand, the opportunity to work with the Salesforce team full-time finally came to fruition in November of 2019. To avoid repetition, to find more details on the Salesforce projects I have worked on while in this role I would point you to my </span><a href=\"/experience\" target=\"_blank\" style=\"font-size: 16px;\"><b>Experience</b></a><span style=\"font-size: 16px;\"> page. Working on such various projects has without a doubt been the biggest bolster to my Salesforce journey. What my Experience page won't show are some of the non-resume benefits of working at Johnson and Johnson. For instance, monthly forums with all J&amp;J Salesforce developers to discuss best practices and showcase any new trending technologies. From technical architects to junior developers, there isn't a single person that doesn't offer something I can learn from. On top of that, I am also thankful that J&amp;J are applying Apex Enterprise Patterns by using a slighlty altered version of </span><a href=\"https://github.com/apex-enterprise-patterns/fflib-apex-common\" target=\"_blank\" style=\"font-size: 16px;\"><b>fflib</b></a>. <span style=\"font-size: 16px;\">Regular Apex programming can be quite different from standard software engineering, but with fflib we are able to apply some of the same methodolgy and best practices. Thus, giving me the opportunity to understand these principles and apply them to whatever other areas of development I may pursue down the road.</span></p><p>&nbsp;</p>"
          },
          "componentName": "forceCommunity:richTextInline",
          "id": "ee8bfecf-d848-4b4c-b2f2-63d78dd95a0e",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        },
        {
          "componentAttributes": {},
          "componentName": "c:salesforceCertifications",
          "id": "31b2ec88-56d3-4e53-89d6-26cc84a80a35",
          "renderPriority": "NEUTRAL",
          "renditionMap": {},
          "type": "component"
        }
      ],
      "id": "f29ef067-f56d-4ccd-bc9a-c2081b631890",
      "regionName": "content",
      "type": "region"
    },
    {
      "id": "a95c32eb-d10b-4fbb-bb32-1a4ca871e8af",
      "regionName": "footer",
      "type": "region"
    },
    {
      "components": [
        {
          "componentAttributes": {
            "customHeadTags": "",
            "description": "",
            "title": "Salesforce"
          },
          "componentName": "forceCommunity:seoAssistant",
          "id": "c7603f00-b9b6-44ac-9ddb-93f438eb8933",
          "renditionMap": {},
          "type": "component"
        }
      ],
      "id": "4048d825-9222-4be7-818f-0257b2cf6474",
      "regionName": "sfdcHiddenRegion",
      "type": "region"
    }
  ],
  "themeLayoutType": "ZlSX501OGSGx1tGUJzEwPcoMwn4Yth",
  "type": "view",
  "viewType": "custom-salesforce"
}
